Repository: nabsba/FlutterFamousPlace
Catalog: lib/l10n/errors/errors_*.arb
Languages: fr

# login
source: Login failed. Please check your credentials and try again.
fr: Échec de la connexion. Veuillez vérifier vos identifiants et réessayer.

# registerUser
source: Registration failed. Please ensure all fields are correct.
fr: Échec de l'enregistrement. Veuillez vous assurer que tous les champs sont corrects.

# registerUserWithCookie
source: Failed to register with the provided cookie. Please try again.
fr: Échec de l'enregistrement avec le cookie fourni. Veuillez réessayer.

# refreshToken
source: Refresh token failed.
fr: Échec du rafraîchissement du token.

# token
source: The token is not valid.
fr: Le token n'est pas valide.

# getPlaces
source: Cannot load places. Please try again later.
fr: Impossible d'afficher les places. Veuillez réessayer plus tard.

# defaultError
source: An error has happened. Please try again. If the problem persists, contact us
fr: Une erreur s'est produite. Veuillez réessayer. Si le problème persiste, contactez-nous

# cannotLoadMoreData
source: Cannot load more data. Please try again later.
fr: Impossible de charger plus de données. Veuillez réessayer plus tard.

# getPlace
source: Cannot load place. Please try again later.
fr: Impossible d'afficher les place. Veuillez réessayer plus tard.

# getPreselectionNames
source: The preselection names were not retrieved successfully.
fr: Les noms de présélection n'ont pas été récupérés avec succès.

# notAllowed
source: The user is not authorised to access the data.
fr: L'utilisateur n'est pas authorisé à acceder aux doonées.
